# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [3]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

createdb: database creation failed: ERROR:  database "pagila" already exists
psql:Data/pagila-schema.sql:43: ERROR:  type "mpaa_rating" already exists
psql:Data/pagila-schema.sql:53: ERROR:  type "year" already exists
psql:Data/pagila-schema.sql:70: ERROR:  function "_group_concat" already exists with same argument types
psql:Data/pagila-schema.sql:87: ERROR:  function "film_in_stock" already exists with same argument types
psql:Data/pagila-schema.sql:104: ERROR:  function "film_not_in_stock" already exists with same argument types
psql:Data/pagila-schema.sql:149: ERROR:  function "get_customer_balance" already exists with same argument types
psql:Data/pagila-schema.sql:171: ERROR:  function "inventory_held_by_customer" already exists with same argument types
psql:Data/pagila-schema.sql:208: ERROR:  function "inventory_in_stock" already exists with same argument types
psql:Data/pagila-schema.sql:226: ERROR:  function "last_day" already exists with same argument types
psql:Data/pagila-schema.sql:241: ERROR:  function "last_updated" already exists with same argument types
psql:Data/pagila-schema.sql:255: ERROR:  relation "customer_customer_id_seq" already exists
psql:Data/pagila-schema.sql:279: ERROR:  relation "customer" already exists
psql:Data/pagila-schema.sql:343: ERROR:  function "rewards_report" already exists with same argument types
psql:Data/pagila-schema.sql:355: ERROR:  function "group_concat" already exists with same argument types
psql:Data/pagila-schema.sql:369: ERROR:  relation "actor_actor_id_seq" already exists
psql:Data/pagila-schema.sql:383: ERROR:  relation "actor" already exists
psql:Data/pagila-schema.sql:397: ERROR:  relation "category_category_id_seq" already exists
psql:Data/pagila-schema.sql:410: ERROR:  relation "category" already exists
psql:Data/pagila-schema.sql:424: ERROR:  relation "film_film_id_seq" already exists
psql:Data/pagila-schema.sql:448: ERROR:  relation "film" already exists
psql:Data/pagila-schema.sql:461: ERROR:  relation "film_actor" already exists
psql:Data/pagila-schema.sql:474: ERROR:  relation "film_category" already exists
psql:Data/pagila-schema.sql:497: ERROR:  relation "actor_info" already exists
psql:Data/pagila-schema.sql:511: ERROR:  relation "address_address_id_seq" already exists
psql:Data/pagila-schema.sql:529: ERROR:  relation "address" already exists
psql:Data/pagila-schema.sql:543: ERROR:  relation "city_city_id_seq" already exists
psql:Data/pagila-schema.sql:557: ERROR:  relation "city" already exists
psql:Data/pagila-schema.sql:571: ERROR:  relation "country_country_id_seq" already exists
psql:Data/pagila-schema.sql:584: ERROR:  relation "country" already exists
psql:Data/pagila-schema.sql:609: ERROR:  relation "customer_list" already exists
psql:Data/pagila-schema.sql:632: ERROR:  relation "film_list" already exists
psql:Data/pagila-schema.sql:646: ERROR:  relation "inventory_inventory_id_seq" already exists
psql:Data/pagila-schema.sql:660: ERROR:  relation "inventory" already exists
psql:Data/pagila-schema.sql:674: ERROR:  relation "language_language_id_seq" already exists
psql:Data/pagila-schema.sql:687: ERROR:  relation "language" already exists
psql:Data/pagila-schema.sql:710: ERROR:  relation "nicer_but_slower_film_list" already exists
psql:Data/pagila-schema.sql:724: ERROR:  relation "payment_payment_id_seq" already exists
psql:Data/pagila-schema.sql:740: ERROR:  relation "payment" already exists
psql:Data/pagila-schema.sql:751: ERROR:  relation "rental_rental_id_seq" already exists
psql:Data/pagila-schema.sql:768: ERROR:  relation "rental" already exists
psql:Data/pagila-schema.sql:787: ERROR:  relation "sales_by_film_category" already exists
psql:Data/pagila-schema.sql:801: ERROR:  relation "staff_staff_id_seq" already exists
psql:Data/pagila-schema.sql:822: ERROR:  relation "staff" already exists
psql:Data/pagila-schema.sql:836: ERROR:  relation "store_store_id_seq" already exists
psql:Data/pagila-schema.sql:850: ERROR:  relation "store" already exists
psql:Data/pagila-schema.sql:872: ERROR:  relation "sales_by_store" already exists
psql:Data/pagila-schema.sql:893: ERROR:  relation "staff_list" already exists
psql:Data/pagila-schema.sql:903: ERROR:  multiple primary keys for table "actor" are not allowed
psql:Data/pagila-schema.sql:911: ERROR:  multiple primary keys for table "address" are not allowed
psql:Data/pagila-schema.sql:919: ERROR:  multiple primary keys for table "category" are not allowed
psql:Data/pagila-schema.sql:927: ERROR:  multiple primary keys for table "city" are not allowed
psql:Data/pagila-schema.sql:935: ERROR:  multiple primary keys for table "country" are not allowed
psql:Data/pagila-schema.sql:944: ERROR:  multiple primary keys for table "film_actor" are not allowed
psql:Data/pagila-schema.sql:952: ERROR:  multiple primary keys for table "film_category" are not allowed
psql:Data/pagila-schema.sql:960: ERROR:  multiple primary keys for table "film" are not allowed
psql:Data/pagila-schema.sql:968: ERROR:  multiple primary keys for table "inventory" are not allowed
psql:Data/pagila-schema.sql:976: ERROR:  multiple primary keys for table "language" are not allowed
psql:Data/pagila-schema.sql:984: ERROR:  multiple primary keys for table "rental" are not allowed
psql:Data/pagila-schema.sql:992: ERROR:  multiple primary keys for table "staff" are not allowed
psql:Data/pagila-schema.sql:1000: ERROR:  multiple primary keys for table "store" are not allowed
psql:Data/pagila-schema.sql:1007: ERROR:  relation "film_fulltext_idx" already exists
psql:Data/pagila-schema.sql:1014: ERROR:  relation "idx_actor_last_name" already exists
psql:Data/pagila-schema.sql:1021: ERROR:  relation "idx_fk_address_id" already exists
psql:Data/pagila-schema.sql:1028: ERROR:  relation "idx_fk_city_id" already exists
psql:Data/pagila-schema.sql:1035: ERROR:  relation "idx_fk_country_id" already exists
psql:Data/pagila-schema.sql:1042: ERROR:  relation "idx_fk_customer_id" already exists
psql:Data/pagila-schema.sql:1049: ERROR:  relation "idx_fk_film_id" already exists
psql:Data/pagila-schema.sql:1056: ERROR:  relation "idx_fk_inventory_id" already exists
psql:Data/pagila-schema.sql:1063: ERROR:  relation "idx_fk_language_id" already exists
psql:Data/pagila-schema.sql:1070: ERROR:  relation "idx_fk_original_language_id" already exists
psql:Data/pagila-schema.sql:1077: ERROR:  relation "idx_fk_payment_customer_id" already exists
psql:Data/pagila-schema.sql:1083: ERROR:  relation "idx_fk_payment_staff_id" already exists
psql:Data/pagila-schema.sql:1092: ERROR:  relation "idx_fk_store_id" already exists
psql:Data/pagila-schema.sql:1099: ERROR:  relation "idx_last_name" already exists
psql:Data/pagila-schema.sql:1106: ERROR:  relation "idx_store_id_film_id" already exists
psql:Data/pagila-schema.sql:1113: ERROR:  relation "idx_title" already exists
psql:Data/pagila-schema.sql:1120: ERROR:  relation "idx_unq_manager_staff_id" already exists
psql:Data/pagila-schema.sql:1127: ERROR:  relation "idx_unq_rental_rental_date_inventory_id_customer_id" already exists
psql:Data/pagila-schema.sql:1133: ERROR:  trigger "film_fulltext_trigger" for relation "film" already exists
psql:Data/pagila-schema.sql:1140: ERROR:  trigger "last_updated" for relation "actor" already exists
psql:Data/pagila-schema.sql:1147: ERROR:  trigger "last_updated" for relation "address" already exists
psql:Data/pagila-schema.sql:1154: ERROR:  trigger "last_updated" for relation "category" already exists
psql:Data/pagila-schema.sql:1161: ERROR:  trigger "last_updated" for relation "city" already exists
psql:Data/pagila-schema.sql:1168: ERROR:  trigger "last_updated" for relation "country" already exists
psql:Data/pagila-schema.sql:1175: ERROR:  trigger "last_updated" for relation "customer" already exists
psql:Data/pagila-schema.sql:1182: ERROR:  trigger "last_updated" for relation "film" already exists
psql:Data/pagila-schema.sql:1189: ERROR:  trigger "last_updated" for relation "film_actor" already exists
psql:Data/pagila-schema.sql:1196: ERROR:  trigger "last_updated" for relation "film_category" already exists
psql:Data/pagila-schema.sql:1203: ERROR:  trigger "last_updated" for relation "inventory" already exists
psql:Data/pagila-schema.sql:1210: ERROR:  trigger "last_updated" for relation "language" already exists
psql:Data/pagila-schema.sql:1217: ERROR:  trigger "last_updated" for relation "rental" already exists
psql:Data/pagila-schema.sql:1224: ERROR:  trigger "last_updated" for relation "staff" already exists
psql:Data/pagila-schema.sql:1231: ERROR:  trigger "last_updated" for relation "store" already exists
psql:Data/pagila-schema.sql:1239: ERROR:  constraint "address_city_id_fkey" for relation "address" already exists
psql:Data/pagila-schema.sql:1247: ERROR:  constraint "city_country_id_fkey" for relation "city" already exists
psql:Data/pagila-schema.sql:1255: ERROR:  constraint "customer_address_id_fkey" for relation "customer" already exists
psql:Data/pagila-schema.sql:1263: ERROR:  constraint "customer_store_id_fkey" for relation "customer" already exists
psql:Data/pagila-schema.sql:1271: ERROR:  constraint "film_actor_actor_id_fkey" for relation "film_actor" already exists
psql:Data/pagila-schema.sql:1279: ERROR:  constraint "film_actor_film_id_fkey" for relation "film_actor" already exists
psql:Data/pagila-schema.sql:1287: ERROR:  constraint "film_category_category_id_fkey" for relation "film_category" already exists
psql:Data/pagila-schema.sql:1295: ERROR:  constraint "film_category_film_id_fkey" for relation "film_category" already exists
psql:Data/pagila-schema.sql:1303: ERROR:  constraint "film_language_id_fkey" for relation "film" already exists
psql:Data/pagila-schema.sql:1311: ERROR:  constraint "film_original_language_id_fkey" for relation "film" already exists
psql:Data/pagila-schema.sql:1319: ERROR:  constraint "inventory_film_id_fkey" for relation "inventory" already exists
psql:Data/pagila-schema.sql:1327: ERROR:  constraint "inventory_store_id_fkey" for relation "inventory" already exists
psql:Data/pagila-schema.sql:1334: ERROR:  constraint "rental_customer_id_fkey" for relation "rental" already exists
psql:Data/pagila-schema.sql:1342: ERROR:  constraint "rental_inventory_id_fkey" for relation "rental" already exists
psql:Data/pagila-schema.sql:1350: ERROR:  constraint "rental_staff_id_fkey" for relation "rental" already exists
psql:Data/pagila-schema.sql:1358: ERROR:  constraint "staff_address_id_fkey" for relation "staff" already exists
psql:Data/pagila-schema.sql:1366: ERROR:  constraint "staff_store_id_fkey" for relation "staff" already exists
psql:Data/pagila-schema.sql:1374: ERROR:  constraint "store_address_id_fkey" for relation "store" already exists
psql:Data/pagila-schema.sql:1384: ERROR:  constraint "payment_customer_id_fkey" for relation "payment" already exists

psql:Data/pagila-data.sql:224: ERROR:  duplicate key value violates unique constraint "actor_pkey"
DETAIL:  Key (actor_id)=(1) already exists.
CONTEXT:  COPY actor, line 1
psql:Data/pagila-data.sql:341: ERROR:  duplicate key value violates unique constraint "country_pkey"
DETAIL:  Key (country_id)=(1) already exists.
CONTEXT:  COPY country, line 1
psql:Data/pagila-data.sql:949: ERROR:  duplicate key value violates unique constraint "city_pkey"
DETAIL:  Key (city_id)=(1) already exists.
CONTEXT:  COPY city, line 1
psql:Data/pagila-data.sql:1560: ERROR:  duplicate key value violates unique constraint "address_pkey"
DETAIL:  Key (address_id)=(1) already exists.
CONTEXT:  COPY address, line 1
psql:Data/pagila-data.sql:1584: ERROR:  duplicate key value violates unique constraint "category_pkey"
DETAIL:  Key (category_id)=(1) already exists.
CONTEXT:  COPY category, line 1
psql:Data/pagila-data.sql:1594: ERROR:  duplicate key value violates unique constraint "store_pkey"
DETAIL:  Key (store_id)=(1) already exists.
CONTEXT:  COPY store, line 1
psql:Data/pagila-data.sql:2201: ERROR:  duplicate key value violates unique constraint "customer_pkey"
DETAIL:  Key (customer_id)=(1) already exists.
CONTEXT:  COPY customer, line 1
psql:Data/pagila-data.sql:2215: ERROR:  duplicate key value violates unique constraint "language_pkey"
DETAIL:  Key (language_id)=(1) already exists.
CONTEXT:  COPY language, line 1
psql:Data/pagila-data.sql:3223: ERROR:  duplicate key value violates unique constraint "film_pkey"
DETAIL:  Key (film_id)=(1) already exists.
CONTEXT:  COPY film, line 1: "1	ACADEMY DINOSAUR	A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The C..."
psql:Data/pagila-data.sql:8693: ERROR:  duplicate key value violates unique constraint "film_actor_pkey"
DETAIL:  Key (actor_id, film_id)=(1, 1) already exists.
CONTEXT:  COPY film_actor, line 1
psql:Data/pagila-data.sql:9701: ERROR:  duplicate key value violates unique constraint "film_category_pkey"
DETAIL:  Key (film_id, category_id)=(1, 6) already exists.
CONTEXT:  COPY film_category, line 1
psql:Data/pagila-data.sql:14290: ERROR:  duplicate key value violates unique constraint "inventory_pkey"
DETAIL:  Key (inventory_id)=(1) already exists.
CONTEXT:  COPY inventory, line 1
psql:Data/pagila-data.sql:14300: ERROR:  duplicate key value violates unique constraint "staff_pkey"
DETAIL:  Key (staff_id)=(1) already exists.
CONTEXT:  COPY staff, line 1
psql:Data/pagila-data.sql:30352: ERROR:  duplicate key value violates unique constraint "rental_pkey"
DETAIL:  Key (rental_id)=(2) already exists.
CONTEXT:  COPY rental, line 1
 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

In [4]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [ ]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [ ]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

Then you can use a SELECT statement to take a look at your new table.

In [ ]:
%sql SELECT * FROM test_table LIMIT 5;

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [ ]:
%sql DROP TABLE test_table

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [ ]:
# payment_date :: DATE = cast(payment_date as date)

In [9]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

In [10]:
%sql select * from dimDate limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(20170407, datetime.date(2017, 4, 7), 2017, 2, 4, 7, 14, False),
 (20170130, datetime.date(2017, 1, 30), 2017, 1, 1, 30, 5, False),
 (20170318, datetime.date(2017, 3, 18), 2017, 1, 3, 18, 11, True),
 (20170426, datetime.date(2017, 4, 26), 2017, 2, 4, 26, 17, False),
 (20170317, datetime.date(2017, 3, 17), 2017, 1, 3, 17, 11, False)]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [11]:
%%sql
INSERT INTO dimCustomer (customer_key, customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT c.customer_id as customer_key, 
    c.customer_id, 
    c.first_name, 
    c.last_name, 
    c.email, 
    a.address, 
    a.address2, 
    a.district, 
    ci.city, 
    co.country, 
    a.postal_code, 
    a.phone, 
    c.active, 
    c.create_date, 
    now()         AS start_date,
    now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

In [12]:
%sql select * from dimCustomer limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 2, 13), datetime.date(2020, 2, 13)),
 (2, 2, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', '1121 Loja Avenue', '', 'California', 'San Bernardino', 'United States', '17886', '838635286649', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 2, 13), datetime.date(2020, 2, 13)),
 (3, 3, 'LINDA', 'WILLIAMS', 'LINDA.WILLIAMS@sakilacustomer.org', '692 Joliet Street', '', 'Attika', 'Athenai', 'Greece', '83579', '448477190408', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 2, 13), datetime.date(2020, 2, 13)),
 (4, 4, 'BARBARA', 'JONES', 'BARBARA.JONES@sakilacustomer.org', '1566 Inegl Manor', '', 'Mandalay', 'Myingyan', 'Myanmar', '53561', '705814003527', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 2, 13), datetime.date(2020, 2, 13)),
 (5, 5, 'ELIZABETH', 'BROWN', 'ELIZABETH.BROWN@sakilacustomer.org', '53 Idfu Parkway', '', 'Nantou', 'Nantou', 'Taiwan', '42399', '10655648674', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2020, 2, 13), datetime.date(2020, 2, 13))]

TODO: Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

In [13]:
%%sql
INSERT INTO dimMovie (movie_key, film_id, title, description, release_year, language, original_language, 
                      rental_duration, length, rating, special_features)
SELECT f.film_id as movie_key, 
    f.film_id, 
    f.title, 
    f.description, 
    f.release_year, 
    l.name AS language, 
    orig_lang.name AS original_language,  
    f.rental_duration, 
    f.length, 
    f.rating, 
    f.special_features
FROM film f
JOIN language l              ON (f.language_id=l.language_id)
LEFT JOIN language orig_lang ON (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

In [14]:
%sql select * from dimMovie limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 'English', None, 6, 86, 'PG', '{"Deleted Scenes","Behind the Scenes"}'),
 (2, 2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 'English', None, 3, 48, 'G', '{Trailers,"Deleted Scenes"}'),
 (3, 3, 'ADAPTATION HOLES', 'A Astounding Reflection of a Lumberjack And a Car who must Sink a Lumberjack in A Baloon Factory', 2006, 'English', None, 7, 50, 'NC-17', '{Trailers,"Deleted Scenes"}'),
 (4, 4, 'AFFAIR PREJUDICE', 'A Fanciful Documentary of a Frisbee And a Lumberjack who must Chase a Monkey in A Shark Tank', 2006, 'English', None, 5, 117, 'G', '{Commentaries,"Behind the Scenes"}'),
 (5, 5, 'AFRICAN EGG', 'A Fast-Paced Documentary of a Pastry Chef And a Dentist who must Pursue a Forensic Psychologist in The Gulf of Mexico', 2006, 'English', None, 6, 130, 'G', '{"Deleted Scenes"}')]

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [15]:
%%sql
INSERT INTO dimStore (store_key, store_id, address, address2, district, city, country, postal_code, 
                      manager_first_name, manager_last_name, start_date, end_date)
SELECT t1.store_id as store_key, 
    t1.store_id, 
    t2.address, 
    t2.address2, 
    t2.district, 
    t3.city, 
    t4.country,  
    t2.postal_code, 
    t5.first_name as manager_first_name, 
    t5.last_name as manager_last_name, 
    now()         AS start_date,
    now()         AS end_date
FROM store t1
JOIN address t2 ON t1.address_id = t2.address_id
JOIN city t3 ON t2.city_id = t3.city_id
join country t4 on t3.country_id = t4.country_id
join staff t5 on t1.manager_staff_id = t5.staff_id;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[]

In [16]:
%sql select * from dimStore limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[(1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2020, 2, 13), datetime.date(2020, 2, 13)),
 (2, 2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.date(2020, 2, 13), datetime.date(2020, 2, 13))]

TODO: Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [17]:
%%sql
INSERT INTO factSales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) as date_key, 
    t1.customer_id as customer_key, 
    t3.film_id as movie_key, 
    t3.store_id as store_key, 
    t1.amount as sales_amount
FROM payment t1
join rental t2 on t1.rental_id = t2.rental_id
join inventory t3 on t2.inventory_id = t3.inventory_id;

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

In [19]:
%sql select * from factSales limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 20170124, 19, 32, 1, 0.99),
 (2, 20170124, 19, 36, 2, 0.99),
 (3, 20170124, 19, 46, 2, 0.99),
 (4, 20170124, 19, 84, 2, 0.99),
 (5, 20170124, 19, 165, 2, 0.99)]

In [ ]:
%sql drop table dimfactSales CASCADE;

In [ ]:
%sql drop table dimCustomer CASCADE;

In [ ]:
%sql drop table dimDate CASCADE;

In [ ]:
%sql drop table dimStore CASCADE;

In [ ]:
%sql drop table dimMovie CASCADE;